'use strict';
class Data {
    constructor() {
        //start-non-standard
        this.data = {
            'data': [
                {
                    'type': 'هوش منطقی - ریاضی',
                    'description': 'هوش منطقی- ریاضی به طور كلی توانایی استفاده از اعداد برای محاسبه و توصیف اشیاء، به كارگیری ریاضی در زندگی روزانه، به كارگیری قوانین ریاضی برای ایجاد بحث تناسب و تقارن، طراحی و مدل سازی می‌باشد. همچنین این ظرفیت هوشی توانایی استدلال منطقی، به خصوص در ریاضی و علوم، ظرفیت تحلیل منطقی مسائل انجام عملیات ریاضی، بررسی سیستماتیك و علمی مسایل، توانایی درك الگوهای ریاضی، تفكر منطقی و استدلال را در بر می‌گیرد. کسانی که هوش منطقی- ریاضی بالایی دارند در استدلال، شناسایی الگوها و تحلیل منطقی مسائل قوی هستند. این افراد به تفکر درباره مفهوم اعداد، روابط و الگوها علاقه‌مندند. ',
                    'advantage': ['مهارت زیاد در حل مساله', 'لذت بردن از تفکر درباره ایده‌های انتزاعی', 'علاقه‌مندی به انجام آزمایش‌های علمی', 'مهارت در انجام محاسبات پیچیده'],
                    'jobs': 'حسابدار، كتابدار، آماردان، تاجر، معمار، برنامه نویس كامپیوتر، آهنگساز، مهندس، پزشك، داروساز، حقوقدان، دانشمند و پژوهشگر و ریاضیدان'
                },
                {
                    'type': 'هوش دیداری - فضایی',
                    'description': 'هوش دیداری- فضایی به توانایی مشاهده كامل و دقیق و شرح دنیای بصری و درك و توصیف گرافیكی ایده‌های بصری به صورت آثار توصیفی و ذهنی اشاره می كند. این مولفه هوشی نمایانگر توانائی افراد در ادراك امور دیداری است. كسانی كه در این مقوله هوشی، تواناترند، تمایل دارند در تصاویر تأمل كنند و می‌خواهند تصاویر ذهنی روشنی برای نگهداری اطلاعات ایجاد كنند چون تصاویر را با وضوح بیشتری نسبت به دیگران در ذهن خود می‌پرورانند. کسانی که هوش دیداری - فضایی بالایی دارند در تجسّم چیزها قوی هستند. این افراد معمولاً جهت‌یابی خوبی دارند و با نقشه‌ها، نمودارها، عکس‌ها و تصاویر ویدیویی مشکلی ندارند. ',
                    'advantage': ['مهارت در درست کردن پازل', 'مهارت در تفسیر عکس، گراف و نمودار', 'لذت بردن از رسم، نقاشی و هنرهای تجسمی', 'تشخیص راحت الگوها'],
                    'jobs': 'طراح، هنرمند، عكاس، دكوراتور منزل، نقاش، طراح لباس، معمار، منتقد هنر، مخترع، آرایشگر، بازیگر، شطرنج باز، فیلمبردار، طراح گرافیكی كامپیوتری، ناخدای كشتی، مجسمه‌ساز، معمار، مكانیك و مهندس'
                },
                {
                    'type': 'هوش زبانی - کلامی',
                    'description': 'هوش كلامی به توانایی استفاده از زبان برای توصیف حوادث، ایجاد ارتباط، ایجاد بخش‌های منطقی و استفاده از استعاره و اصطلاحات برای بیان افكار خود اشاره می‌كند کسانی که هوش کلامی- زبانی بالایی دارند به خوبی می‌توانند از کلمات، به هنگام نوشتن و حرف زدن، استفاده کنند. این افراد غالباً در نوشتن داستان، به خاطر سپردن اطلاعات و خواندن مهارت دارند.',
                    'advantages': ['مهارت در به یادآوردن اطلاعات نوشته یا گفته شده', 'لذت بردن از خواندن و نوشتن', 'مهارت در مباحثه یا صحبت‌های متقاعد کننده', 'توانائی در توضیح دادن مسائل', 'استفاده از شوخ‌طبعی به هنگام بیان داستان‌ها'],
                    'jobs': 'روزنامه نگار، مدیر، پیمانكار، فروشنده، روحانی، مشاور، وكیل، پروفسور، فیلسوف، نمایشنامه نویس، شاعر، طراح آگهی، داستان نویس، ناشر، دلال، برنامه نویس كامپیوتر، مدیریت نشریه و روزنامه'
                },
                {
                    'type': 'هوش بدنی - جنبشی',
                    'description': 'هوش بدنی – جنبشی به توانایی فرد در استفاده، كنترل و هماهنگ كردن حركات بدنی– جنبشی و به كارگیری ماهرانه اشیاء اشاره دارد. این مؤلفه هوشی بر قابلیت استفاده فرد از كل بدن یا بخش‌هایی از بدن، مثلاً به كارگیری حركات ظریف انگشتان یا دست‌ها در حل مسائل تأكید می‌كند. کسانی که هوش بدنی- جنبشی بالایی دارند در حرکت‌های بدنی، انجام عملیات و کنترل فیزیکی قوی هستند. این افراد در هماهنگ سازی چشم و دست مهارت دارند و افراد چالاک وتردستی هستند.',
                    'advantage': ['مهارت در ورزش و رقص', 'لذت بردن از ساختن چیزها با دست', 'هماهنگی فیزیکی عالی', 'به خاطر سپردن چیزها از طریق انجام دادن آن‌ها، به جای گوش کردن یا دیدن'],
                    'jobs': 'خیاط، آشپز، نجار، مدل ساز ماهر، فیزیوتراپ، هنرپیشه، صنعتگر، طلا‌ساز، ورزشكار، معمار، خلبان، فروشنده، طراح، آهنگر، استاد تربیت بدنی'
                },
                {
                    'type': 'هوش میان فردی',
                    'description': 'هوش بین‌فردی به توانایی تشخیص جنبه‌های ظریف رفتاری دیگران، شناخت و درك نیات، انگیزه‌ها و خواست‌های دیگران، كه منجر به ارتباط مؤثر با دیگران می‌شود اشاره می كند. به عبارتی دیگر هوش بین‌فردی، توانائی درك دیگران است. اینكه چه چیزی آن‌ها را برانگیخته می‌كند؟ چگونه كار می‌كنند؟ و چگونه می شود با آن‌ها همكاری كرد. کسانی که هوش میان فردی بالایی دارند در تعامل با دیگران و درک آن‌ها قوی هستند.این افراد در سنجش هیجانات، انگیزه‌ها، تمایلات و منظور کسانی که دور و برشان هستند مهارت دارند. ',
                    'advantage': ['مهارت در برقراری ارتباط کلامی', 'مهارت در ارتباط غیرکلامی', '	نگاه کردن به موقعیت‌ها از زوایای مختلف', 'ایجاد روابط مثبت با دیگران', 'مهارت در فرو نشاندن اختلافات در داخل گروه‌ها'],
                    'jobs': 'درمانگر، مشاور، فروشنده، سیاستمدار، كاسب، معلم، پزشك و رهبر مذهبی موفق'
                },
                {
                    'type': 'هوش درون فردی',
                    'description': 'به توانایی آگاه شدن از احساس‌ها، انگیزه ها و امیال خود، و استفاده از این شناخت درونی در جهت حل مسایل و كنترل شرایط اشاره دارد. به عبارت دیگر توانایی ارزیابی قوت‌ها، ضعف‌ها، استعدادها، علائق و به كارگیری آن‌ها برای رسیدن به اهداف، درك و شناخت خود برای كمك به دیگران می باشد. کسانی که هوش درون فردی بالایی دارند، آگاهی خوبی از وضعیت هیجانی، احساسات و انگیزه‌های خود دارند. این افراد از خودآزمایی، تخیل روزانه، کند و کاو کردن روابط خود با دیگران و برآورد توانائی‌های فردی خود لذت می‌برند. ). این افراد دنیای درونی خود را ترجیح می‌دهند، دوست دارند تنها باشند و اغلب احساس عمیقی از عزت نفس، استقلال و آرزوی قوی دارند؛ و خود را برای انجام پروژه‌های مطالعاتی مستقل بر می‌انگیزند. دوست دارند هر كاری را بدانند؛ احساساتشان را كنترل می‌كنند؛ و خود را به خوبی می‌شناسند. متفكر، مستقل، خودمدار و سیاستمدارند. قاطعانه از احساس، اعتقاد، و انگیزه خود دفاع می‌كنند. مسئولیت اعمال خود را می‌پذیرند و محدودیت‌های خود را قبول دارند. در پی بازخورد اعمال خود در دیگران هستند. در حوزه‌ای كه می‌دانند در آن ضعیفند، فعالیت می‌كنند و بر هدف بزرگی كه در سر می‌پروراند پافشاری می‌كنند. از عدم موفقیت سرخورده نمی‌شوند',
                    'advantage': ['مهارت در تحلیل نقاط قوت و ضعف خود', 'لذت بردن از تجزیه و تحلیل نظریه‌ها وایده‌ها', '	خودآگاهی زیاد', 'داشتن درک روشن از ریشه انگیزه‌ها و احساسات خود'],
                    'jobs': 'نقشه‌كش، روان‌شناس، رهبر مذهبی، نویسنده، پژوهشگر، نظریه پرداز و فیلسوف'
                },
                {
                    'type': 'هوش موسیقیایی',
                    'description': 'هوش موسیقیایی به توانایی فهمیدن، گسترش و پیشرفت متون موسیقی، پاسخگویی به موسیقی، درك اشكال و ایده‌های موسیقی، ایجاد عملكرد ذهنی و آهنگ‌سازی اشاره می‌كند. این هوش بسیار سریع‌تر از سایر هوش‌ها ظهور می‌كند. در دوران نوزادی كودكان همان‌طور كه قان و قون می‌كنند، آواز می خوانند، می‌‌توانند اصوات دیگران را تقلید كرده و یا اصواتی را تولید كنند. کسانی که هوش موسیقیایی بالایی دارند در فکر کردن به الگوها، ریتم‌ها و صداها قوی هستند. این افراد از موسیقی لذت می‌برند و معمولاً در نواختن سازهای موسیقی و آهنگسازی مهارت دارند. ',
                    'advantage': ['لذت بردن از آوارخوانی و نواختن سازهای موسیقی', '	تشخیص آسان الگوها و نت‌های موسیقی', '	توانایی به خاطرسپردن آهنگ‌ها و ملودی‌ها', '	درک عمیق از ساختار، ریتم و نت‌های موسیقی'],
                    'jobs': 'آهنگساز، نوازنده، موسیقی دان و خواننده'
                },
                {
                    'type': 'هوش طبیعت گرا',
                    'description': 'هوش طبیعت‌گرا، توانایی بازشناسی و طبقه بندی گونه‌ها در محیط زندگی خود می‌باشد. قابلیت شناخت عناصر یك گروه، تمایز بین عناصر و گونه‌ها و درك روابط بین آن‌ها، به صورت رسمی و غیررسمی، را در بر می‌گیرد. کسانی که دارای هوش طبیعت‌گرای بالایی هستند، سازگاری بیشتری با طبیعت دارند و معمولاً به پرورش، کشف محیط و یادگیری درباره موجودات علاقه‌مندند. این افراد به سرعت از جزئی‌ترین تغییرات در محیط ‌شان آگاه می‌شوند. ',
                    'advantage': ['علاقه‌مند به موضوعاتی از قبیل گیاه‌شناسی، زیست‌شناسی و جانورشناسی', 'مهارت در رده‌بندی و فهرست بندی اطلاعات', 'لذت بردن از باغبانی، کشف طبیعت، پیاده‌روی و چادر زدن در طبیعت', ' بی‌علاقگی به یادگیری موضوعات بی‌ارتباط با طبیعت'],
                    'jobs': 'زیست شناس، معلم، مامور پارک، گیاه شناس، كشاورز، دانشمند علوم طبیعی، علوم آزمایشگاهی، باغبان، دامپزشك و زمین شناس'
                }
            ]
        };
        //end-non-standard
    }
}
export default Data;